chapter11/readme.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Chapter 11</title>
<meta name="author" content="(Bill Carlson)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/sky.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Chapter 11</h1><h2 class="author">Bill Carlson</h2><p class="date">Created: 2018-03-30 Fri 10:08</p>
</section>

<section>
<section id="slide-org3156bdd">
<h2 id="org3156bdd">Exercises</h2>
<div class="outline-text-2" id="text-org3156bdd">
</div>
</section>
</section>
<section>
<section id="slide-org84aa83a">
<h3 id="org84aa83a">Dog Types</h3>
<div class="org-src-container">

<pre><code class="haskell" >data Doggies a = Husky a
               | Mastiff a
     deriving (Eq, Show)

data DogueDeBordeaux doge = DogueDeBordeaux doge
</code></pre>
</div>
</section>
<section id="slide-orgbb5971b">
<h4 id="orgbb5971b">Dog Types</h4>
<p>
Is Doggies a type constructor or a data constructor?
</p>
<ul class="fragment">
<li>Type constructor</li>

</ul>

<p>
What is the kind of Doggies?
</p>
<ul class="fragment">
<li><code>* -&gt; *</code></li>

</ul>
<p>
What is the kind of Doggies String?
</p>
<ul class="fragment">
<li><code>*</code></li>

</ul>

</section>
<section id="slide-orgf808da0">
<h4 id="orgf808da0">Dog Types</h4>
<p>
What is the type of Husky 10?
</p>
<ul class="fragment">
<li><code>Num a =&gt; Doggies a</code></li>

</ul>

<p>
What is the type of Husky (10 :: Integer)?
</p>
<ul class="fragment">
<li><code>Doggies Integer</code></li>

</ul>

<p>
What is the type of Mastiff "Scooby Doo"?
</p>
<ul class="fragment">
<li><code>Doggies [Char]</code></li>

</ul>

</section>
<section id="slide-org87207d6">
<h4 id="org87207d6">Dog Types</h4>
<p>
Is DogueDeBordeaux a type constructor or a data constructor?
</p>
<ul class="fragment">
<li>Both? One of each?</li>

</ul>

<p>
What is the type of DogueDeBordeaux?
</p>
<ul class="fragment">
<li><code>doge -&gt; DogueDeBordeaux doge</code></li>

</ul>

<p>
What is the type of DogueDeBordeaux "doggie!"
</p>
<ul class="fragment">
<li><code>DogueDeBordeaux [Char]</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org1ae9ff2">
<h3 id="org1ae9ff2">Vehicles</h3>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >isCar :: Vehicle -> Bool
isCar (Car _ _) = True
isCar _ = False
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="haskell" >isPlane :: Vehicle -> Bool
isPlane (Plane _) = True
isPlane _ = False
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="haskell" >areCars :: [Vehicle] -> [Bool]
areCars = map isCar
</code></pre>
</div>

<div class="org-src-container">

<pre class="fragment"><code class="haskell" >getManu :: Vehicle -> Manufacturer
getManu (Car man _) = man
getMenu (Plane man) = man
</code></pre>
</div>


</section>
</section>
<section>
<section id="slide-org3b8873f">
<h3 id="org3b8873f">Cardinality</h3>
<div class="org-src-container">

<pre><code class="haskell" >data PugType = PugData
</code></pre>
</div>
<p class="fragment">
1
</p>

<div class="org-src-container">

<pre><code class="haskell" >data Airline = PapuAir | CatapultsR'Us | TakeYourChancesUnited
</code></pre>
</div>
<p class="fragment">
3
</p>

<div class="org-src-container">

<pre><code class="haskell" >Int16
</code></pre>
</div>
<p class="fragment">
65536
</p>

</section>
<section id="slide-org52f0653">
<h4 id="org52f0653">Cardinality</h4>
<div class="org-src-container">

<pre><code class="haskell" >Int
Integer
</code></pre>
</div>
<p class="fragment">
18446744073709552000 / Not bounded
</p>

<p>
What's the connection between the <code>8</code> in <code>Int8</code> and <code>256</code>?
</p>
<p class="fragment">
256 == 2<sup>8</sup>
</p>

</section>
</section>
<section>
<section id="slide-org17d9329">
<h3 id="org17d9329">For Example</h3>
<div class="org-src-container">

<pre><code class="haskell" >data Example = MakeExample deriving Show
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >λ> :t MakeExample
MakeExample :: Example
</code></pre>
</div>
<pre  class="fragment">
λ&gt; :t Example
&lt;interactive&gt;:1:1-7: error: Data constructor not in scope: Example
</pre>

</section>
<section id="slide-org48e0aab">
<h4 id="org48e0aab">For Example</h4>
<div class="org-src-container">

<pre><code class="haskell" >λ> :i Example
data Example = MakeExample  -- Defined at Chapter11.hs:48:1
instance [safe] Show Example -- Defined at Chapter11.hs:48:37
</code></pre>
</div>

</section>
<section id="slide-orgd2e5177">
<h4 id="orgd2e5177">For Example</h4>
<div class="org-src-container">

<pre><code class="haskell" >λ> data Example = MakeExample Int deriving Show
λ> :t MakeExample
MakeExample :: Int -> Example
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgb9ed98e">
<h3 id="orgb9ed98e">Logic Goats</h3>
<div class="org-src-container">

<pre><code class="haskell" >Chapter11.hs:15:1-7: error:
    Multiple declarations of ‘tooMany’
    Declared at: Chapter11.hs:11:1
                 Chapter11.hs:15:1
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org99882cb">
<h3 id="org99882cb">Pity the Bool</h3>
<p>
What is the cardinality of
</p>
<div class="org-src-container">

<pre><code class="haskell" >data BigSmall = Big Bool | Small Bool deriving (Eq, Show)
</code></pre>
</div>
<ul>
<li>(Big Bool) + (Small Bool)</li>
<li>2 + 2</li>
<li>4</li>

</ul>

</section>
<section id="slide-orga665836">
<h4 id="orga665836">Pity the Bool</h4>
<div class="org-src-container">

<pre><code class="haskell" >-- bring Int8 in scope
import Data.Int
data NumberOrBool = Numba Int8 | BoolyBool Bool deriving (Eq, Show)
-- parentheses due to syntactic
-- collision between (-) minus
-- and the negate function
let myNumba = Numba (-128)
</code></pre>
</div>
<ul>
<li>(Numba Int8) + (BoolyBool Bool)</li>
<li>256 + 2</li>
<li>258</li>

</ul>

</section>
</section>
<section>
<section id="slide-org8c42be2">
<h3 id="org8c42be2">How Does Your Garden Grow?</h3>
<div class="org-src-container">

<pre><code class="haskell" >data FlowerType = Gardenia | Daisy | Rose | Lilac deriving Show
type Gardener = String
data Garden = Garden Gardener FlowerType deriving Show
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >data Garden = Gardener Gardenia 
            | Gardener Daisy
            | Gardener Rose
            | Gardener Lilac
            deriving Show
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org9688067">
<h3 id="org9688067">Programmers</h3>
<div class="org-src-container">

<pre><code class="haskell" >allOperatingSystems :: [OperatingSystem]
allOperatingSystems =
  [ GnuPlusLinux
  , OpenBSDPlusNevermindJustBSDStill
  , Mac
  , Windows
  ]

allLanguages :: [ProgLang]
allLanguages =
  [Haskell, Agda, Idris, PureScript]

allProgrammers :: [Programmer]
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >allProgrammers = [Programmer opsys language
                 | opsys <- allOperatingSystems,
                   language <- allLanguages]
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org61fd0d1">
<h3 id="org61fd0d1">The Quad</h3>
<div class="org-src-container">

<pre><code class="haskell" >data Quad = One
          | Two
          | Three
          | Four
          deriving (Eq, Show)
</code></pre>
</div>
<p>
How many different forms can this take? 
</p>
<div class="org-src-container">

<pre><code class="haskell" >eQuad :: Either Quad Quad
</code></pre>
</div>
<p class="fragment">
4 + 4 = 8
</p>

</section>
<section id="slide-org514fd26">
<h4 id="org514fd26">The Quad</h4>
<div class="org-src-container">

<pre><code class="haskell" >prodQuad :: (Quad, Quad)
</code></pre>
</div>
<p class="fragment">
4 * 4 = 16
</p>

</section>
<section id="slide-org2ede6aa">
<h4 id="org2ede6aa">The Quad</h4>
<div class="org-src-container">

<pre><code class="haskell" >funcQuad :: Quad -> Quad
</code></pre>
</div>
<p class="fragment">
4<sup>4</sup> = 256
</p>

</section>
<section id="slide-org81c81be">
<h4 id="org81c81be">The Quad</h4>
<div class="org-src-container">

<pre><code class="haskell" >prodTBool :: (Bool, Bool, Bool)
</code></pre>
</div>
<p class="fragment">
2 * 2 * 2 = 8
</p>

</section>
<section id="slide-orgf34e18a">
<h4 id="orgf34e18a">The Quad</h4>
<div class="org-src-container">

<pre><code class="haskell" >gTwo :: Bool -> Bool -> Bool
</code></pre>
</div>
<p class="fragment">
(2<sup>2</sup>)<sup>2</sup> = 2<sup>2 * 2</sup> = 16
</p>

</section>
<section id="slide-orgfd87b3d">
<h4 id="orgfd87b3d">The Quad</h4>
<div class="org-src-container">

<pre><code class="haskell" >fTwo :: Bool -> Quad -> Quad -- FIVE digit number!
</code></pre>
</div>
<p class="fragment">
(4<sup>4</sup>)<sup>2</sup> = (4<sup>8</sup>) = 65536
</p>

</section>
</section>
<section>
<section id="slide-orgc993b20">
<h2 id="orgc993b20">Chapter Exercises</h2>
<div class="outline-text-2" id="text-orgc993b20">
</div>
</section>
</section>
<section>
<section id="slide-org5185307">
<h3 id="org5185307">Multiple Choice</h3>
<p>
Given the following datatype:
</p>
<div class="org-src-container">

<pre><code class="haskell" >data Weekday = Monday
             | Tuesday
             | Wednesday
             | Thursday
             | Friday
</code></pre>
</div>
<p>
we can say:
</p>
<p class="fragment">
<b>Weekday is a type with five data constructors</b>
</p>

</section>
<section id="slide-orgca42f70">
<h4 id="orgca42f70">Multiple Choice</h4>
<p>
With the same datatype definition in mind, what is the type of the following function, f?
</p>
<div class="org-src-container">

<pre><code class="haskell" >f Friday = "Miller Time"
</code></pre>
</div>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >f :: Weekday -> [Char]
</code></pre>
</div>

</section>
<section id="slide-orgf169ab4">
<h4 id="orgf169ab4">Multiple Choice</h4>
<p>
Types defined with the <code>data</code> keyword
</p>
<p class="fragment">
(b) must begin with a capital letter
</p>

</section>
<section id="slide-orgbc745ee">
<h4 id="orgbc745ee">Multiple Choice</h4>
<p>
The function 
</p>
<div class="org-src-container">

<pre><code class="haskell" >g xs = xs !! (length xs - 1)
</code></pre>
</div>
<p class="fragment">
c) delivers the final element of xs
</p>

</section>
</section>
<section>
<section id="slide-orgdbbef1e">
<h3 id="orgdbbef1e">Ciphers</h3>
<p>
See <a href="./Caesar.hs">Caesar.hs</a>
</p>

</section>
</section>
<section>
<section id="slide-org1072158">
<h3 id="org1072158">As-Patterns</h3>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >isSubSeqOf :: Eq a => [a] -> [a] -> Bool
isSubSeqOf sub full = go sub full
  where go [] _ = True
        go _ [] = False
        go subrem@(x:xs) (y:ys) =
          if x == y then go xs ys
          else go subrem ys
</code></pre>
</div>

</section>
<section id="slide-org2469a56">
<h4 id="org2469a56">As-Patterns</h4>
<div class="org-src-container">

<pre><code class="haskell" >capitalizeWords :: String -> [(String, String)]
capitalizeWords sentence = map capitalize (words sentence)
  where capitalize "" = ("", "")
        capitalize w@(x:xs) = (w, toUpper x : xs)
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org979efa2">
<h3 id="org979efa2">Language Exercises</h3>
<p>
Write a function that capitalizes a word
</p>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >capitalizeWord :: String -> String
capitalizeWord (x:xs) = toUpper x : xs
capitalizeWord "" = ""
</code></pre>
</div>
</section>
<section id="slide-orgdb4e6a6">
<h4 id="orgdb4e6a6">Language Exercises</h4>
<p>
Write a function that capitalizes sentences in a paragraph.
</p>
<div class="org-src-container">

<pre class="fragment"><code class="haskell" >
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgec1fcf0">
<h3 id="orgec1fcf0">Phone Exercise</h3>
<p>
<a href="./Phone.hs">Phone.hs</a>
</p>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
